performance_test_results_k6_grafana/k6-results/load_test - place_order.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /src/services/rest/test_runner.js
        output: InfluxDBv1 (http://influxdb:8086)

     scenarios: (100.00%) 1 scenario, 40 max VUs, 20m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 20m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✗ Status is 200
      ↳  98% — ✓ 21979 / ✗ 255

     checks.........................: 98.85% 21979 out of 22234
     data_received..................: 10 MB  8.5 kB/s
     data_sent......................: 5.8 MB 4.9 kB/s
     http_req_blocked...............: avg=14.19µs min=1.08µs   med=7.66µs   max=7.4ms    p(90)=23.12µs  p(95)=27.25µs 
     http_req_connecting............: avg=1.13µs  min=0s       med=0s       max=7.29ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=1.4ms   min=146.54µs med=1.02ms   max=201.32ms p(90)=2.59ms   p(95)=3.05ms  
       { expected_response:true }...: avg=1.4ms   min=146.54µs med=1.01ms   max=201.32ms p(90)=2.58ms   p(95)=3.05ms  
   ✗ http_req_failed................: 1.14%  255 out of 22234
     http_req_receiving.............: avg=76.98µs min=5.41µs   med=54.08µs  max=43.4ms   p(90)=133.79µs p(95)=168.43µs
     http_req_sending...............: avg=42.44µs min=3.37µs   med=26.83µs  max=9.35ms   p(90)=83.62µs  p(95)=100.51µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=1.28ms  min=136.08µs med=925.74µs max=201.14ms p(90)=2.37ms   p(95)=2.82ms  
     http_reqs......................: 22234  18.522676/s
     iteration_duration.............: avg=1s      min=1s       med=1s       max=1.2s     p(90)=1.01s    p(95)=1.01s   
     iterations.....................: 22234  18.522676/s
     vus............................: 1      min=1              max=40
     vus_max........................: 40     min=40             max=40


running (20m00.4s), 00/40 VUs, 22234 complete and 0 interrupted iterations
default ✓ [======================================] 00/40 VUs  20m0s
ERRO[1200] thresholds on metrics 'http_req_failed' have been crossed 
exit status 99