performance_test_results_k6_grafana/k6-results/scalability_test - find_pets_by_status.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /src/services/rest/test_runner.js
        output: InfluxDBv1 (http://influxdb:8086)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 38m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 38m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)

WARN[2205] The flush operation took higher than the expected set push interval. If you see this message multiple times then the setup or configuration need to be adjusted to achieve a sustainable rate.  output=InfluxDBv1 t=1.01469475s

     ✗ Status is 200
      ↳  0% — ✓ 0 / ✗ 186760

     checks.....................: 0.00%   0 out of 186760
     data_received..............: 89 MB   39 kB/s
     data_sent..................: 24 MB   10 kB/s
     http_req_blocked...........: avg=4.89µs   min=750ns     med=2.7µs    max=8.11ms  p(90)=7.2µs    p(95)=11.45µs
     http_req_connecting........: avg=440ns    min=0s        med=0s       max=7.91ms  p(90)=0s       p(95)=0s     
   ✓ http_req_duration..........: avg=483.02µs min=101.29µs  med=333.33µs max=23.04ms p(90)=866.54µs p(95)=1.34ms 
   ✗ http_req_failed............: 100.00% 186760 out of 186760
     http_req_receiving.........: avg=33.71µs  min=5.08µs    med=23.45µs  max=4.78ms  p(90)=65.08µs  p(95)=89.5µs 
     http_req_sending...........: avg=21.06µs  min=-120014ns med=7.83µs   max=6.78ms  p(90)=26.08µs  p(95)=53.62µs
     http_req_tls_handshaking...: avg=0s       min=0s        med=0s       max=0s      p(90)=0s       p(95)=0s     
     http_req_waiting...........: avg=428.24µs min=90µs      med=291.29µs max=22.65ms p(90)=754.8µs  p(95)=1.21ms 
     http_reqs..................: 186760  81.875479/s
     iteration_duration.........: avg=1s       min=1s        med=1s       max=2.04s   p(90)=1.01s    p(95)=1.02s  
     iterations.................: 186760  81.875479/s
     vus........................: 1       min=1                max=200
     vus_max....................: 200     min=200              max=200


running (38m01.0s), 000/200 VUs, 186760 complete and 0 interrupted iterations
default ✓ [======================================] 000/200 VUs  38m0s
ERRO[2281] thresholds on metrics 'http_req_failed' have been crossed 
exit status 99