performance_test_results_k6_grafana/k6-results/scalability_test - get_inventory.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /src/services/rest/test_runner.js
        output: InfluxDBv1 (http://influxdb:8086)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 38m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 38m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ Status is 200

     checks.........................: 100.00% 187009 out of 187009
     data_received..................: 73 MB   32 kB/s
     data_sent......................: 20 MB   8.9 kB/s
     http_req_blocked...............: avg=6.65µs   min=791ns   med=3.7µs    max=5.18ms  p(90)=10.12µs p(95)=18.27µs 
     http_req_connecting............: avg=414ns    min=0s      med=0s       max=4.3ms   p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=629.06µs min=72.79µs med=390.75µs max=52.7ms  p(90)=1.23ms  p(95)=1.99ms  
       { expected_response:true }...: avg=629.06µs min=72.79µs med=390.75µs max=52.7ms  p(90)=1.23ms  p(95)=1.99ms  
   ✓ http_req_failed................: 0.00%   0 out of 187009
     http_req_receiving.............: avg=41.71µs  min=5µs     med=27.5µs   max=47.22ms p(90)=79.87µs p(95)=115.66µs
     http_req_sending...............: avg=20.91µs  min=2.2µs   med=9.91µs   max=16.41ms p(90)=33.08µs p(95)=59.33µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=566.43µs min=60.12µs med=342.45µs max=52.63ms p(90)=1.11ms  p(95)=1.82ms  
     http_reqs......................: 187009  82.003344/s
     iteration_duration.............: avg=1s       min=1s      med=1s       max=1.38s   p(90)=1.01s   p(95)=1.01s   
     iterations.....................: 187009  82.003344/s
     vus............................: 1       min=1                max=200
     vus_max........................: 200     min=200              max=200


running (38m00.5s), 000/200 VUs, 187009 complete and 0 interrupted iterations
default ✓ [======================================] 000/200 VUs  38m0s